JayHeng/kFlashFile/bsp/imxrt1170_a0/flash_drv/fsl_flexspi.c
    return status;
}

status_t flexspi_init(uint32_t instance, flexspi_mem_config_t *config)
{
    uint32_t mcr0;
    status_t status = kStatus_InvalidArgument;

    do
    {
        FLEXSPI_Type *base = flexspi_get_module_base(instance);

        if ((base == NULL) || (config == NULL))
        {
            break;
        }

        /* Determine if the flexspi serial clock should be configured to safe frequency
         *
         *  ROM configures the FlexSPI Serial clock to 30MHz if one of below case is met:
         *  1. ROM is required to configure external device to certain modes at safe frequency
         */
        bool need_safe_freq = (config->deviceModeCfgEnable || config->configCmdEnable) &&
                              ((config->controllerMiscOption & (1 << kFlexSpiMiscOffset_SafeConfigFreqEnable)));

        if (config->tag != FLEXSPI_CFG_BLK_TAG)
        {
            break;
        }

        /*
         *  !!! Important !!!
         *  The module clock must be disabled during clock switch in order to avoid glitch
         */
        // Do not re-configure FLEXSPI IP when it is busy
        if (is_flexspi_clock_enabled(instance))
        {
            flexspi_wait_idle(instance);
        }
        flexspi_clock_gate_disable(instance);
        flexspi_iomux_config(instance, config);
        if (need_safe_freq)
        {
            // Configure FlexSPI serial clock using safe frequency
            flexspi_clock_config(instance, kFlexSpiSerialClk_SafeFreq, kFlexSpiClk_SDR);
        }
        else
        {
            // Configure FlexSPI serial clock with specified frequency
            flexspi_clock_config(instance, config->serialClkFreq, flexspi_is_ddr_mode_enable(config));
        }
        // Enable FlexSPI Clock Gate
        flexspi_clock_gate_enable(instance);

        base->MCR0 &= ~FLEXSPI_MCR0_MDIS_MASK;
        flexspi_swreset(base);

        // Disable FlexSPI module during configuring control registers.
        base->MCR0 |= FLEXSPI_MCR0_MDIS_MASK;

        // Set Clock divider and sample clock source
        mcr0 = base->MCR0 & (uint32_t) ~(FLEXSPI_MCR0_RXCLKSRC_MASK | FLEXSPI_MCR0_IPGRANTWAIT_MASK |
                                         FLEXSPI_MCR0_AHBGRANTWAIT_MASK | FLEXSPI_MCR0_COMBINATIONEN_MASK |
                                         FLEXSPI_MCR0_ATDFEN_MASK | FLEXSPI_MCR0_ARDFEN_MASK);

        // If this condition meets, it means FlexSPI PORT B exists, the the 8 bit is supported by combining PORTA[3:0]
        // with PORTB[3:0]
        if ((sizeof(base->FLSHCR1) / sizeof(base->FLSHCR1[0])) > 2)
        {
            // Enable Combined mode if Serial FLASH works using Octal pad instructions.
            if (config->sflashPadType == kSerialFlash_8Pads)
            {
                mcr0 |= FLEXSPI_MCR0_COMBINATIONEN_MASK;
            }
        }

        // Configure AHBGRANTWAIT and IPGRANTWAIT
        mcr0 |= FLEXSPI_MCR0_IPGRANTWAIT_MASK | FLEXSPI_MCR0_AHBGRANTWAIT_MASK;
        // Configure Read sample clock source
        mcr0 |= FLEXSPI_MCR0_RXCLKSRC(config->readSampleClkSrc);
        base->MCR0 = mcr0;

        // Configure MCR1
        flexspi_config_mcr1(instance, config);

        // Configure MCR2
        base->MCR2 &= ~FLEXSPI_MCR2_SAMEDEVICEEN_MASK;

        // If this condition meets, it means FlexSPI PORT B exists, SCKB pads used as PORTB SCK with be used a inverted
        // SCK for PORTA
        // Enable differential clock as needed.
        if ((sizeof(base->FLSHCR1) / sizeof(base->FLSHCR1[0])) > 2)
        {
            if (flexspi_is_differential_clock_enable(config))
            {
                base->MCR2 |= FLEXSPI_MCR2_SCKBDIFFOPT_MASK;
            }
        }

        // Configure AHB buffer
        flexspi_config_ahb_buffers(base, config);

        // Configure Flash related control registers
        flexspi_config_flash_control_registers(instance, config);

        // Configure DLLCR
        flexspi_configure_dll(instance, config);

        // Enable FlexSPI before updating LUT.
        base->MCR0 &= ~FLEXSPI_MCR0_MDIS_MASK;

        // Reset all registers except control registers
        flexspi_swreset(base);

        if (config->deviceModeCfgEnable)
        {
            status = flexspi_device_workmode_config_all_chips(instance, config);
            if (status != kStatus_Success)
            {
                break;
            }
        }

        if (config->configCmdEnable)
        {
            status = flexspi_device_cmd_config_all_chips(instance, config);
            if (status != kStatus_Success)
            {
                break;
            }
        }

        // Restore clock
        if (need_safe_freq)
        {
            /*
             *  !!! Important !!!
             *  The module clock must be disabled during clock switch in order to avoid glitch
             */
            base->MCR0 |= FLEXSPI_MCR0_MDIS_MASK;
            // Re-configure FlexSPI Serial clock frequency in order to acheive high performance.
            flexspi_clock_config(instance, config->serialClkFreq, flexspi_is_ddr_mode_enable(config));

            // Re-Configure MCR1
            flexspi_config_mcr1(instance, config);
            // Re-configure DLLCR
            flexspi_configure_dll(instance, config);
            base->MCR0 &= ~FLEXSPI_MCR0_MDIS_MASK;
        }

        status = kStatus_Success;

    } while (0);

    return status;
}

status_t flexspi_update_lut(uint32_t instance, uint32_t seqIndex, const uint32_t *lutBase, uint32_t seqNumber)
{
    status_t status = kStatus_InvalidArgument;

    do
    {
        FLEXSPI_Type *base = flexspi_get_module_base(instance);

        if ((base == NULL) || (lutBase == NULL) || (((uint64_t)seqIndex + seqNumber) > 16))
        {
            break;
        }

        flexspi_wait_until_ip_idle(base);

        uint32_t start_index = 0;
        uint32_t end_index = 0;
        volatile uint32_t *flexspiLutPtr;

        flexspi_unlock_lut(base);

        start_index = 4 * seqIndex;
        end_index = 4 * (seqIndex + seqNumber);
        flexspiLutPtr = &base->LUT[start_index];
        while (start_index < end_index)
        {
            *flexspiLutPtr = *lutBase;
            start_index++;
            flexspiLutPtr++;
            lutBase++;
        }

        flexspi_lock_lut(base);

        status = kStatus_Success;

    } while (0);

